# Pandas

## Exercicios Series

#### Exercicio 1

Maria está acompanhando suas despesas diárias ao longo de um mês. Pra isso, ela tem as seguintes series:


```
dias_da_semana = ['Seg', 'Ter', 'Qua', 'Qui', 'Sex', 'Sab', 'Dom']
semana1 = pd.Series([50, 66, 55, 55, 23, np.nan, 92], index=dias_da_semana)
semana2 = pd.Series([np.nan, 78, 76, 66, 64, 44, 78], index=dias_da_semana)
semana3 = pd.Series([55, 75, 89, 77, 78, 57, np.nan], index=dias_da_semana)
semana4 = pd.Series([67, 34, np.nan, 25, 45, np.nan, 95], index=dias_da_semana)

```

Como você pode ver, para cada uma destas semanas, há um ou mais valores faltando. Dito isto:
- Preencha cada valor faltante com a média do mesmo dia da semana para o conjunto das 4 semanas.
- Para cada semana, imprima o gasto total, o gasto médio, o gasto mediano, o gasto máximo, o gasto mínimo e o desvio padrão.
- Para cada semana, imprima o gasto total dos dias úteis e o gasto total do final de semana.

In [2]:
import numpy as np
import pandas as pd

In [3]:
dias_da_semana = ['Seg', 'Ter', 'Qua', 'Qui', 'Sex', 'Sab', 'Dom']
semana1 = pd.Series([50, 66, 55, 55, 23, np.nan, 92], index=dias_da_semana)
semana2 = pd.Series([np.nan, 78, 76, 66, 64, 44, 78], index=dias_da_semana)
semana3 = pd.Series([55, 75, 89, 77, 78, 57, np.nan], index=dias_da_semana)
semana4 = pd.Series([67, 34, np.nan, 25, 45, np.nan, 95], index=dias_da_semana)

In [4]:
media_dia_da_semana = []

for i in range(0, len(dias_da_semana)):
    media_dia_da_semana.append(pd.Series([semana1.iloc[i], semana2.iloc[i], semana3.iloc[i], semana4.iloc[i]]).mean())

In [5]:
semanas = [semana1, semana2, semana3, semana4]
for i in range(0, len(dias_da_semana)):
    for semana in semanas:
        if np.isnan(semana.iloc[i]):
            semana.iloc[i] = media_dia_da_semana[i]

In [6]:
for semana in semanas:
    print('')
    print(semana.sum())
    print(semana.mean())
    print(semana.median())
    print(semana.max())
    print(semana.min())
    print(semana.std())

391.5
55.92857142857143
55.0
92.0
23.0
20.62851701615301

463.33333333333337
66.19047619047619
66.0
78.0
44.0
12.58873267951109

519.3333333333334
74.19047619047619
77.0
89.0
55.0
13.578110301698073

389.8333333333333
55.69047619047619
50.5
95.0
25.0
24.283134783644282

In [7]:
for semana in semanas:
    print('')
    print(semana.iloc[:-2].sum())
    print(semana.iloc[-2:].sum())

249.0
142.5

341.33333333333337
122.0

374.0
145.33333333333331

244.33333333333331
145.5

In [8]:
# Resolução professor:
media_por_dia_semana = pd.Series()
for dia in dias_da_semana:
    media_por_dia_semana.loc[dia] = pd.Series([semana1.loc[dia], semana2.loc[dia], semana3.loc[dia], semana4.loc[dia]]).mean()
    
for dia in dias_da_semana:
    for semana in semanas:
        if(np.isnan(semana.loc[dia])):
            semana.loc[dia] = media_por_dia_semana.loc[dia]

for semana in semanas:
    print('')
    print(semana.sum())
    print(semana.mean())
    print(semana.median())
    print(semana.max())
    print(semana.min())
    print(semana.std())
    
for semana in semanas:
    print('')
    print(semana.loc['Seg':'Sex'].sum())
    print(semana.loc['Sab':'Dom'].sum())

391.5
55.92857142857143
55.0
92.0
23.0
20.62851701615301

463.33333333333337
66.19047619047619
66.0
78.0
44.0
12.58873267951109

519.3333333333334
74.19047619047619
77.0
89.0
55.0
13.578110301698073

389.8333333333333
55.69047619047619
50.5
95.0
25.0
24.283134783644282

249.0
142.5

341.33333333333337
122.0

374.0
145.33333333333331

244.33333333333331
145.5

#### Exercicio 2

Você tem uma serie chamada `clientes` com mil posições que retratam os tomadores de crédito do seu banco e que os divide nas categorias 'cliente novo', 'cliente adimplente' e 'cliente inadimplente'. Considere o código abaixo como gerador desta lista:

```
valores_possiveis = ['cliente novo', 'cliente adimplente', 'cliente inadimplente']
probabilidades = np.random.dirichlet(np.ones(len(valores_possiveis)), size=1).flatten()
clientes = pd.Series(np.random.choice(valores_possiveis, size=1000, p=probabilidades))
```

Descubra como os clientes desta serie estão distribuídos nas três categorias, primeiro em valores absolutos e depois em valores percentuais.

In [9]:
valores_possiveis = ['cliente novo', 'cliente adimplente', 'cliente inadimplente']
probabilidades = np.random.dirichlet(np.ones(len(valores_possiveis)), size=1).flatten()
clientes = pd.Series(np.random.choice(valores_possiveis, size=1000, p=probabilidades))

In [10]:
print(f"Distribuição absoluta: \n{clientes.value_counts()}")
print(f"Porcentagens:\n{clientes.value_counts(True)}")

Distribuição absoluta:
cliente adimplente      564
cliente inadimplente    222
cliente novo            214
Name: count, dtype: int64
Porcentagens:
cliente adimplente      0.564
cliente inadimplente    0.222
cliente novo            0.214
Name: proportion, dtype: float64

#### Exercicio 3

João é um gerente de uma loja de eletrônicos e está acompanhando o estoque de produtos em sua loja. Ele possui duas séries pandas, conforme o código a seguir: uma série contendo os nomes dos produtos disponíveis em estoque e outra série contendo a quantidade em estoque de cada produto.

```
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])
```

João deseja filtrar os produtos que têm estoque baixo, ou seja, aqueles que têm menos de 10 unidades disponíveis. Ajude-o a fazer isso utilizando a filtragem de uma série usando outra série como máscara.

In [11]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

In [12]:
mask = quantidade_estoque<10
produtos[mask]

1            Tablet
3    Fone de Ouvido
dtype: object

## DataFrames

### Definição e leitura/escrita com arquivos

O `DataFrame` é uma representação de uma tabela. Ele possui dois eixos rotulados, que são as linhas (rotuladas pelo índice, ou `index`) e as colunas (rotuladas por um objeto índice para o nome das colunas).

Existem diversas maneiras de se criar um dataframe, podendo ser a partir de listas, dicionários etc.  
Um dos modos mais comuns é a criação a partir da leitura de um arquivo no formato `.csv`, como veremos a seguir para o caso do dataset `titanic`, muito conhecido por quem trabalha com ciência de dados. O dataset pode ser baixado [aqui](https://www.kaggle.com/competitions/titanic/data).

In [15]:
df_titanic = pd.read_csv('./train.csv')

In [16]:
df_titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Note que `df_titanic` é um `DataFrame` com os dados do arquivo `train.csv`. Com relação à pasta na qual o código foi executado, este arquivo está localizado em `datasets/`.

Vemos que o parâmetro do método `pd.read_csv` é o nome do arquivo que se deseja ler, com o caminho relativo até o arquivo.

Existem diversos parâmetros relevantes. Todos podem ser encontrados na [documentação do Pandas](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html).

> **Observação:**  
> Note que podemos também utilizar um arquivo do formato `.xlsx`, natural do excel.  
> Para tanto, devemos utilizar o método `pd.read_excel`.
>
> É possível também milhares de outros formatos menos comuns, como `.data`, `.txt`, e outros.
> O método mais geral para leitura destes formatos é `pd.read_table`.

A segunda forma de construir um DataFrame é a partir de variáveis do Python. O primeiro exemplo que veremos é como construir um DataFrame a partir de um dicionário do Python.

Este é um método muito útil, pois a estrutura de `dict`, nativa do Python, é bem semelhante à de um `DataFrame`.  

Neste caso, cada chave do nosso dicionário se tornará uma **coluna** enquanto os valores (que podem ser elementos de listas, arrays, series...) serão os elementos do dataframe.

In [17]:
dicionario = {
    'COL_A': [1,2,3,4,5],
    'COL_B': ['A', 'B', 'C', 'D', 'E'],
    'COL_C': [100,200,300,400,500]
}

In [18]:
df = pd.DataFrame(dicionario)

In [19]:
df

   COL_A COL_B  COL_C
0      1     A    100
1      2     B    200
2      3     C    300
3      4     D    400
4      5     E    500

In [31]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'Produto': produtos,
    'Quantidade': quantidade_estoque
}

df_produtos = pd.DataFrame(dicionario)
df_produtos

          Produto  Quantidade
0         Celular          15
1          Tablet           8
2        Notebook          20
3  Fone de Ouvido           5
4      Smartwatch          12

Um outro método, que já vimos antes neste material, é passando uma lista de listas (ou um array bidimensional do NumPy).

In [32]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'])
df

   altura  peso
0    1.69  87.0
1    1.59  56.5
2    1.69  90.3
3    1.74  78.6

Muitas das propriedades das séries Pandas se mantêm para DataFrames. A diferença é que agora, além de um atributo `index` com os nomes das linhas, teremos um segundo atributo `columns` com os nomes das colunas.

In [33]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
df.shape

(4, 2)

In [35]:
df.columns

Index(['altura', 'peso'], dtype='object')

Por fim, para salvar o nosso dataframe, podemos usar métodos como `to_csv`, `to_json`, `to_html`, entre outros.

In [37]:
df
df.to_csv('./alturas_e_pesos.csv')

### Acesso de elementos

As formas de se acessar os valores de um `DataFrame` são análogas ao que vimos antes com séries do pandas. A única diferença é que agora teremos de usar dois índices, a linha e a coluna.

In [50]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'], index=['a', 'b', 'c', 'd'])
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [51]:
df['altura']

a    1.69
b    1.59
c    1.69
d    1.74
Name: altura, dtype: float64

In [52]:
df['peso']

a    87.0
b    56.5
c    90.3
d    78.6
Name: peso, dtype: float64

In [53]:
df[['altura', 'peso']]

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [57]:
df['peso']['a'] # se tentarmos fazer como Python, fazemos [coluna][linha], usando os rótulos

87.0

In [55]:
df.iloc[0,1] # No caso do iloc, fazemos [linha, coluna], usando a posição

87.0

In [58]:
df.loc['a', 'peso'] # No caso do loc, fazemos [linha, coluna], usando os rótulos

87.0

In [66]:
df.loc['b']

altura     1.59
peso      56.50
Name: b, dtype: float64

In [67]:
df.loc[:, 'altura']

a    1.69
b    1.59
c    1.69
d    1.74
Name: altura, dtype: float64

In [68]:
df['altura'].loc['b']

1.59